{
  "source": "error-control-coding-by-shu-lin_O.pdf",
  "pages": [
    {
      "page": 14,
      "text": "Preface\nThis book owes its beginnings to the pioneering work of Claude Shannon in 1948\non achieving reliable communication over a noisy transmission channel. Shannon’s\ncentral theme was that if the signaling rate of the system is less than the channel\ncapacity, reliable communication can be achieved if one chooses proper encoding\nand decoding techniques. The design of good codes and of efficient decoding methods,\ninitiated by Hamming, Slepian, and others in the early 1950s, has occupied the\nenergies of many researchers since then. Much of this work is highly mathematical\nin nature, and requires an extensive background in modern algebra and probability\ntheory to understand. This has acted as an impediment to many practicing engineers\nand computer scientists, who are interested in applying these techniques to real sys-\ntems. One of the purposes of this book is to present the essentials of this highly\ncomplex material in such a manner that it can be understood and applied with only\na minimum of mathematical background.\nWork on coding in the 1950s and 1960s was devoted primarily to developing the\ntheory of efficient encoders and decoders. In 1970, the first author published a book\nentitled An introduction to Error-Correcting Codes, which presented the fundamentals\nof the previous two decades of work covering both block and convolutional codes.\nThe approach was to explain the material in an easily understood manner, with a\nminimum of mathematical rigor. The present book takes the same approach to cover-\ning the fundamentals of coding. However, the entire manuscript has been rewritten\nand much new material has been added. In particular, during the 1970s the emphasis\nin coding research shifted from theory to practical applications. Consequently, three\ncompletely new chapters on the applications of coding to digital transmission and\nstorage systems have been added. Other major additions include a comprehensive\ntreatment of the error-detecting capabilities of block codes, and an emphasis on\nprobabilistic decoding methods for convolutional codes. A brief description of each\nchapter follows.\nChapter | presents an overview of coding for error control in data transmission\nxiii"
    }
  ]
}